import os
import sys
import time
print('''
 _____      __   ___            ___  ___      ___   ____________        ___           ___   
|     \    |  |  \  \          /  /  |  |    /  /  |____    ____|      |   |         |   |
|  |\  \   |  |   \  \        /  /   |  |   /  /        |  |           |   |         |   |
|  | \  \  |  |    \  \      /  /    |  |__/  /         |  |           |   |         |   |
|  |  \  \ |  |     \  \    /  /     |  |__  |          |  |      ____/    |    ____/    |
|  |   \  \|  |      \  \  /  /      |  |  \  \         |  |     /   ___   |   /   ___   |  
|  |    \  \  |       \  \/  /       |  |   \  \        |  |    |   |___|  |  |   |___|  |
|__|     \____|        \____/        |__|    \__\       |__|     \ _______/    \ _______/
      ''')
time.sleep(1)
while True:
    awa = 0
    print ("欢迎使用亲属性别计算器!")
    awa = input('''
    请输入您的亲属：
    1.父亲
    2.母亲
    3.儿子
    4.女儿
    5.哥哥
    6.弟弟
    7.姐姐
    8.妹妹
        ''')
    qwq = -1
    if awa == '1' or awa == '3' or awa == '5' or awa == '6':
        qwq = 0
    elif awa == '2' or awa == '4' or awa == '7' or awa == '8':
        qwq = 1
    else:
        print("亲属输入错误(╬▔皿▔)╯")
    if qwq == 0:
        print("您的亲属是男性")
    elif qwq == 1:
        print("您的亲属是女性")
    else:
        print("亲属输入错误(╬▔皿▔)╯")
    input("请按回车键继续")